/*大纲
第一章 算法分析基础
第二章 线性表、堆、栈、队列
第三章 数组、字符串
第四章 树
第五章 图
第六章 递归
第七章 排序
第八章 查找

为什么？
数据结构 是 程序设计 的基础
它也是 专业课 的基础

数据？
数据是对象的表示，只是表示而没有含义。
数据是计算机科学与技术的最基本概念，是“原料”
包括：能被计算机识别存储和加工处理的符号总称
a = a+b ;
数据：数字，字符串char\string，图片【张量（矩阵）】，影像，声音【节点的音高，一维张量】，
数据元素（数据成分/元素/节点/顶点）
数据项（域/字段）

数据结构：把一些数据 组织起来 进行： 增、删、查、改

算法：有限步骤内解决数学问题的方法。
特性：
1.有限性->算法在执行有限步骤后必须结束。
2.确定性->对每个步骤，每个动作都必须严格无歧义。
3.输入->0个或多个
4.输出->1个或多个
5.可行性->操作必须是基本的：人类用纸、笔就能算

算法能执行，必然有的特性（评估的五大原则）：
1.正确性
2.时间复杂性
3.空间复杂性：数据存储空间、栈空间
4.可读性
5.鲁棒性

复杂度分析
复杂度的渐进表示：
大O表示法->操作次数的上限
大Ω表示法->操作次数的下限
大这个表示法->操作次数的数量级

f(n)和g(n) 分别是正整数集到正实数集上的函数，有f(n) = O(g(n)) f(n)<=Cg(n),存在正整数C,n0,n>=n0
f(n)和g(n) 分别是正整数集到正实数集上的函数，有f(n) = 这个(g(n)) C1g(n)<=f(n)<=C2g(n),存在正整数C,n0,n>=n0
O(1),O(logn),O(n),O(nlogn)堆优化dijk,O(n^2)dijkstla,O(n^3)Floyd
n^2
*/
